# **Конспект по SQL**

In [2]:
%load_ext sql
%sql sqlite://

# **Основные понятия для работы с SQL**

Мои обозначения:

[ ] - опционально




*********************************************************************************************************************

Основные принципы реляционной БД:
- Данные представляются в виде таблиц
- В ячейку таблицы можно занести лишь одно значение
(отношение - это кортеж данных, проще говоря таблица)
- Все операции выполняются на полными таблицами (над целыми отношениями)
 и результатом этих операций является таблица (отношение)

атрибут (поле) - столбец в таблице

кортеж - строка в таблице

таблица n*m, где n - мощность (число кортежей), m - размерность (число атрибутов)

домен атрибута - допустимые значения, которые можно вписать в поле (в ячейку поля)

имена таблицы (отношения) и поля могут содержать строчные латинские буквы (должно с них начинаться),
цифры и знак подчёркивания

Типы данных:


*   INT (INTEGER) - по модулю примерно меньше чем 2 * 10**9
*   DECIMAL(a, b) (или NUMERIC), где a - общее максимальное количество цифр b - максимальное число цифр после запятой
*   DATE в формате ГГГГ-ММ-ДД со значением по умолчанию 1900-01-01
*   DATETIME в формате ГГГГ-ММ-ДД ЧЧ:ММ:СС со значением по умолчанию 1900-01-01 00:00:00
*   VARCHAR(N), где N - макисмальное количество символов
*   NVARCHAR(N) - в отличие от VARCHAR(N), может хранить данные в колировке Unicode

# **Создание и заполнение/изменение таблицы**

Создание таблицы:

INT PRIMARY KEY AUTO_INCREMENT - в поле первичного ключа будут вноситься натуральные числа в порядковом номере

В конце SQL-запроса ставится точка с запятой (если запрос один, то необязательно)

    
CREATE TABLE name_of_table (

	field1 INT PRIMARY KEY AUTO_INCREMENT,
    filed2 VARCHAR(25),
    field3 DATE
);


Создание таблицы на основе другой таблицы:
CREATE TABLE name_of_table AS
SELECT ...;

Где SELECT - оператор запроса полей из таблицы.

In [3]:
%%sql
SELECT 10 AS 'ten';

 * sqlite://
Done.

[(10,)]

Добавление данных в таблицу

INSERT [INTO] name_of_table(field2, field3)

VALUES
       (value21, value31),

       (value22, value32);  

здесь нет поля1 и значения1, т.к. это primary key и он устанавливается сам автоматически.

In [4]:
%%sql
DROP TABLE IF EXISTS author;
DROP TABLE IF EXISTS genre;
DROP TABLE IF EXISTS book;

 * sqlite://
Done.
Done.
Done.

[]

-- Создание таблицы с внешними ключами
FOREIGN KEY (связанное поле зависимой таблицы) REFERENCES головная таблица (связанное поле зависимой таблицы) -
задаёт связь в одну сторону (один ко многим)

ON DELETE - устанавливает действия (при создании внешнего ключа), которые выполняются при удалении записей из
подчинённой таблицы. Речь идёт только о связанных записях в таблицах.
Список действий:

*   CASCADE - удаляет строки зависимой таблицы при удалении строки из
головной таблицы
*   SET NULL - устанавливает для столбца внешнего ключа значение NULL при удалении строки головной таблицы
*   SET DEFAULT - устанавливает для столбца внешнего ключа значение ПО УМОЛЧАНИЮ при удалении строки головной таблицы
*   RESTRICT - отклоняет удаление строк в головной таблице при наличии записей в связанной таблице

In [5]:
%%sql

CREATE TABLE author
    (
        author_id INTEGER PRIMARY KEY AUTOINCREMENT,
        name_author VARCHAR(50)
    );

INSERT INTO author (name_author)
VALUES ('Булгаков М.А.'),
       ('Достоевский Ф.М.'),
       ('Есенин С.А.'),
       ('Пастернак Б.Л.');

CREATE TABLE genre
    (
        genre_id INTEGER PRIMARY KEY AUTOINCREMENT,
        name_genre varchar(30)
    );

INSERT INTO genre (name_genre)
VALUES ('Роман'),
       ('Поэзия'),
       ('Приключения');

CREATE TABLE book
    (
        book_id INTEGER PRIMARY KEY AUTOINCREMENT,
        title VARCHAR(50),
        author_id INT,
        genre_id int,
        price DECIMAL(8, 2),
        amount INT,
        FOREIGN KEY (author_id) REFERENCES author (author_id) ON DELETE CASCADE,
        FOREIGN KEY (genre_id) REFERENCES genre (genre_id) ON DELETE SET NULL
    );

INSERT INTO book (title, author_id, genre_id, price, amount)
VALUES ('Мастер и Маргарита', 1, 1, 670.99, 3),
       ('Белая гвардия ', 1, 1, 540.50, 5),
       ('Идиот', 2, 1, 460.00, 10),
       ('Братья Карамазовы', 2, 1, 799.01, 3),
       ('Игрок', 2, 1, 480.50, 10),
       ('Стихотворения и поэмы', 3, 2, 650.00, 15),
       ('Черный человек', 3, 2, 570.20, 6),
       ('Лирика', 4, 2, 518.99, 2);

 * sqlite://
Done.
4 rows affected.
Done.
3 rows affected.
Done.
8 rows affected.

[]

In [6]:
%%sql
SELECT *
FROM book;

 * sqlite://
Done.

[(1, 'Мастер и Маргарита', 1, 1, 670.99, 3),
 (2, 'Белая гвардия ', 1, 1, 540.5, 5),
 (3, 'Идиот', 2, 1, 460, 10),
 (4, 'Братья Карамазовы', 2, 1, 799.01, 3),
 (5, 'Игрок', 2, 1, 480.5, 10),
 (6, 'Стихотворения и поэмы', 3, 2, 650, 15),
 (7, 'Черный человек', 3, 2, 570.2, 6),
 (8, 'Лирика', 4, 2, 518.99, 2)]

Изменим некоторые строки в таблице book по некоторому условию

In [7]:
%%sql
UPDATE book
SET price = 500.0
WHERE price < 490;

SELECT *
FROM book;

 * sqlite://
2 rows affected.
Done.

[(1, 'Мастер и Маргарита', 1, 1, 670.99, 3),
 (2, 'Белая гвардия ', 1, 1, 540.5, 5),
 (3, 'Идиот', 2, 1, 500, 10),
 (4, 'Братья Карамазовы', 2, 1, 799.01, 3),
 (5, 'Игрок', 2, 1, 500, 10),
 (6, 'Стихотворения и поэмы', 3, 2, 650, 15),
 (7, 'Черный человек', 3, 2, 570.2, 6),
 (8, 'Лирика', 4, 2, 518.99, 2)]

Добавим в таблицу новую колонку

In [8]:
%%sql

ALTER TABLE book ADD COLUMN rating NUMERIC(2, 1);
UPDATE book
SET rating = IIF(price < 600, 3.0, IIF(price < 700, 4.1, 5.0));
SELECT *
FROM book;

 * sqlite://
Done.
8 rows affected.
Done.

[(1, 'Мастер и Маргарита', 1, 1, 670.99, 3, 4.1),
 (2, 'Белая гвардия ', 1, 1, 540.5, 5, 3),
 (3, 'Идиот', 2, 1, 500, 10, 3),
 (4, 'Братья Карамазовы', 2, 1, 799.01, 3, 5),
 (5, 'Игрок', 2, 1, 500, 10, 3),
 (6, 'Стихотворения и поэмы', 3, 2, 650, 15, 4.1),
 (7, 'Черный человек', 3, 2, 570.2, 6, 3),
 (8, 'Лирика', 4, 2, 518.99, 2, 3)]

Изменим название колонки. Не в SQLite писали бы ALTER COLUMN, а не RENAME COLUMN

In [9]:
%%sql

ALTER TABLE book RENAME COLUMN rating TO RATING;
SELECT *
FROM book;

 * sqlite://
Done.
Done.

[(1, 'Мастер и Маргарита', 1, 1, 670.99, 3, 4.1),
 (2, 'Белая гвардия ', 1, 1, 540.5, 5, 3),
 (3, 'Идиот', 2, 1, 500, 10, 3),
 (4, 'Братья Карамазовы', 2, 1, 799.01, 3, 5),
 (5, 'Игрок', 2, 1, 500, 10, 3),
 (6, 'Стихотворения и поэмы', 3, 2, 650, 15, 4.1),
 (7, 'Черный человек', 3, 2, 570.2, 6, 3),
 (8, 'Лирика', 4, 2, 518.99, 2, 3)]

Удалим нашу новую колонку из таблицы

In [10]:
%%sql

ALTER TABLE book DROP COLUMN rating;
SELECT *
FROM book;

 * sqlite://
Done.
Done.

[(1, 'Мастер и Маргарита', 1, 1, 670.99, 3),
 (2, 'Белая гвардия ', 1, 1, 540.5, 5),
 (3, 'Идиот', 2, 1, 500, 10),
 (4, 'Братья Карамазовы', 2, 1, 799.01, 3),
 (5, 'Игрок', 2, 1, 500, 10),
 (6, 'Стихотворения и поэмы', 3, 2, 650, 15),
 (7, 'Черный человек', 3, 2, 570.2, 6),
 (8, 'Лирика', 4, 2, 518.99, 2)]

# **Подзапросы**

In [11]:
%%sql

SELECT *
FROM book
WHERE author_id NOT IN (SELECT author_id FROM book WHERE author_id <= 3)

 * sqlite://
Done.

[(8, 'Лирика', 4, 2, 518.99, 2)]

# **Группировка и агрегирующие функции**

In [12]:
%%sql

SELECT SUM(price) AS sum
FROM book;

 * sqlite://
Done.

[(4749.69,)]

In [13]:
%%sql

SELECT ROUND(AVG(price), 2) AS average
FROM book;

 * sqlite://
Done.

[(593.71,)]

In [14]:
%%sql

SELECT MIN(price) AS min
FROM book;

 * sqlite://
Done.

[(500,)]

In [15]:
%%sql

SELECT MAX(price) AS max
FROM book;

 * sqlite://
Done.

[(799.01,)]

Внутри агрегирующих функций НЕЛЬЗЯ писать подзапросы

In [16]:
%%sql

SELECT SUM(SELECT price FROM book WHERE author_id = 4) AS sum
FROM book;

 * sqlite://
(sqlite3.OperationalError) near "SELECT": syntax error
[SQL: SELECT SUM(SELECT price FROM book WHERE author_id = 4) AS sum
FROM book;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

Выполним группировку по author_id. При этом в таблице все поля, кроме агрегирующих функций должны быть указаны БЕЗ ПСЕВДОНИМА в GROUP BY

In [17]:
%%sql

SELECT author_id,
       SUM(price) as sum
FROM book
GROUP BY author_id;

 * sqlite://
Done.

[(1, 1211.49), (2, 1799.01), (3, 1220.2), (4, 518.99)]

Хотя SQLite вроде хавает :)

In [18]:
%%sql

SELECT author_id,
       genre_id,
       SUM(price) as sum
FROM book
GROUP BY author_id;

 * sqlite://
Done.

[(1, 1, 1211.49), (2, 1, 1799.01), (3, 2, 1220.2), (4, 2, 518.99)]

In [19]:
%%sql

SELECT author_id,
       genre_id,
       SUM(price) as sum
FROM book
GROUP BY author_id, genre_id;

 * sqlite://
Done.

[(1, 1, 1211.49), (2, 1, 1799.01), (3, 2, 1220.2), (4, 2, 518.99)]

Отсортируем данные. Если хотим по убыванию - ставим DESC. Если по возрастанию - опционально ставим ASC

In [20]:
%%sql

SELECT author_id,
       SUM(price) as sum
FROM book
GROUP BY author_id
ORDER BY author_id DESC;

 * sqlite://
Done.

[(4, 518.99), (3, 1220.2), (2, 1799.01), (1, 1211.49)]

Внутри WHERE нельзя использовать агрегирующие функции. Для этого есть HAVING, который можно использовать без GROUP BY

In [21]:
%%sql

SELECT author_id,
       SUM(price) as sum
FROM book
GROUP BY author_id
HAVING SUM(price) > 1215
ORDER BY author_id DESC;

 * sqlite://
Done.

[(3, 1220.2), (2, 1799.01)]

In [22]:
%%sql

SELECT *
FROM book
HAVING price > AVG(price);

 * sqlite://
(sqlite3.OperationalError) a GROUP BY clause is required before HAVING
[SQL: SELECT *
FROM book
HAVING price > AVG(price);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

В SQLite, как видно, нельзя использовать HAVING без GROUP BY :)

Но, например, в PostgreSQL - можно

Посмотрим на пример применения всего выше изложенного. Найдём жанр, количество книг которого больше всего.

Всем таблицам из подзапросов внутри FROM необходимо давать псевдоним

In [26]:
%%sql

SELECT genre_id,
       SUM(amount) AS amount
FROM book
GROUP BY genre_id
HAVING SUM(amount) = (
    SELECT MAX(s)
    FROM(
        SELECT genre_id,
        SUM(amount) AS s
        FROM book
        GROUP BY genre_id
    ) AS sub_table

);

 * sqlite://
Done.

[(1, 31)]

В этом запросе мы делаем запрос на сумму всех книг по каждому жанру, выбираем из него строку с максимальной суммой и в основном запросе, с помощью HAVING, делаем отбор по равенству с максимальной суммой

Но здесь мы не знаем жанр книги, мы знаем только id жанра. Исправим это в параграфе "Соединения таблиц"

# **Соединения таблиц**

Типы соединения:

- [ INNER ] JOIN
- LEFT [ OUTER ] JOIN
- RIGHT [ OUTER ] JOIN (не поддерживается в SQLite)
- CROSS JOIN (вместо этого можно писать таблицы через запятую)

Работают они так: Рассматривают первую таблицу (всегда левая, кроме RIGHT JOIN), для каждой строки проверяется совпадение с каждой строкой второй таблицы. Если совпадение найдено, добавляется на вывод эта строка. Таких совпадений для одной строки из первой таблицы может быть несколько и, поэтому, будет выведено несколько строк. В общем, ниже всё есть ;)

Рассмотрим их на примере ниже для новых таблиц, специально для этого созданных

In [28]:
%%sql

CREATE TABLE one (
    a INT
);

CREATE TABLE two (
    b INT
);


INSERT INTO one(a)
VALUES (1), (3), (2), (2), (NULL);

INSERT INTO two(b)
VALUES (1), (2), (NULL), (4), (2), (NULL);

 * sqlite://
Done.
Done.
5 rows affected.
6 rows affected.

[]

In [29]:
%%sql

SELECT *
FROM one INNER JOIN two ON a = b;

 * sqlite://
Done.

[(1, 1), (2, 2), (2, 2), (2, 2), (2, 2)]

In [30]:
%%sql

SELECT *
FROM one LEFT JOIN two ON a = b;

 * sqlite://
Done.

[(1, 1), (3, None), (2, 2), (2, 2), (2, 2), (2, 2), (None, None)]

In [32]:
%%sql

SELECT *
FROM two LEFT JOIN one ON a = b;

 * sqlite://
Done.

[(1, 1), (2, 2), (2, 2), (None, None), (4, None), (2, 2), (2, 2), (None, None)]

In [35]:
%%sql

SELECT *
FROM one, two;

 * sqlite://
Done.

[(1, 1),
 (1, 2),
 (1, None),
 (1, 4),
 (1, 2),
 (1, None),
 (3, 1),
 (3, 2),
 (3, None),
 (3, 4),
 (3, 2),
 (3, None),
 (2, 1),
 (2, 2),
 (2, None),
 (2, 4),
 (2, 2),
 (2, None),
 (2, 1),
 (2, 2),
 (2, None),
 (2, 4),
 (2, 2),
 (2, None),
 (None, 1),
 (None, 2),
 (None, None),
 (None, 4),
 (None, 2),
 (None, None)]

In [39]:
%%sql

SELECT *,
       COUNT(*) as '5*6 (len(a) * len(b))'
FROM one, two;

 * sqlite://
Done.

[(1, 1, 30)]

Теперь поправим последний длинный запрос из прошлого параграфа

In [42]:
%%sql

SELECT name_genre,
       SUM(amount) AS amount
FROM book JOIN genre ON book.genre_id = genre.genre_id
GROUP BY name_genre
HAVING SUM(amount) = (
    SELECT MAX(s)
    FROM(
        SELECT genre_id,
        SUM(amount) AS s
        FROM book
        GROUP BY genre_id
    ) AS sub_table

);

 * sqlite://
Done.

[('Роман', 31)]

Когда поля в разных таблицах называются одинаково, можно использовать USING()

In [43]:
%%sql

SELECT name_genre,
       SUM(amount) AS amount
FROM book JOIN genre USING(genre_id)
GROUP BY name_genre
HAVING SUM(amount) = (
    SELECT MAX(s)
    FROM(
        SELECT genre_id,
        SUM(amount) AS s
        FROM book
        GROUP BY genre_id
    ) AS sub_table

);

 * sqlite://
Done.

[('Роман', 31)]

Но этот запрос очень длинный и содержит 2 подзапроса и выглядит очень длинно. При больших объёмах данных это будет долго работать.

Это можно исправить, используя оконные функции (смотри параграф ниже)

Можно также помимо столбцов, пристыковывать строки. Для этого у таблиц должно запрашиваться одинаковое количество
Для реализации пристыковки строк необходимо соединять запросы
UNION соединит и удалит повторения
UNION ALL соединит и НЕ удалит повторения

In [50]:
%%sql

SELECT a
FROM one
WHERE a = 1

UNION

SELECT b
FROM two
WHERE b = 2

 * sqlite://
Done.

[(1,), (2,)]

In [52]:
%%sql

SELECT a
FROM one
WHERE a = 1

UNION ALL

SELECT b
FROM two
WHERE b = 2

 * sqlite://
Done.

[(1,), (2,), (2,)]

In [53]:
%%sql

ALTER TABLE one ADD COLUMN str1 VARCHAR(10) DEFAULT 'Hello A';
ALTER TABLE two ADD COLUMN str2 VARCHAR(10) DEFAULT 'Hello B';

SELECT *
FROM one
WHERE a = 1

UNION ALL

SELECT str2,
       b
FROM two
WHERE b = 2;

 * sqlite://
Done.
Done.
Done.

[(1, 'Hello A'), ('Hello B', 2), ('Hello B', 2)]

В ячейке выше оператор DEFAULT отвечает за значение по умолчанию

# **Оконные функции**

Синтаксис такой: OVER([ PARTITION BY ] ... [ ORDER BY ] ...)

Оператор LIMIT задаёт количество строк, которые будут выведены.

Оператор OFFSET задаёт номер строки такой, что будут выведены все строки, начиная со следующей. По умолчанию его значение 0.

Эти операторы можно комбинировать. Например, если мы хотим только десятую строку из таблицы, то в конце запроса нужно написать следующее:

LIMIT 1 OFFSET 9

In [56]:
%%sql

SELECT name_genre,
       SUM(amount) OVER(PARTITION BY name_genre) AS amount
FROM book JOIN genre ON book.genre_id = genre.genre_id
ORDER BY 2 DESC
LIMIT 1;

 * sqlite://
Done.

[('Роман', 31)]

Теперь запрос выглядит приятнее и по-человечески)

Рассмотрим остальные оконные функции

In [58]:
%%sql

SELECT name_author,
       ROW_NUMBER() OVER() AS w
FROM book JOIN author USING(author_id)

 * sqlite://
Done.

[('Булгаков М.А.', 1),
 ('Булгаков М.А.', 2),
 ('Достоевский Ф.М.', 3),
 ('Достоевский Ф.М.', 4),
 ('Достоевский Ф.М.', 5),
 ('Есенин С.А.', 6),
 ('Есенин С.А.', 7),
 ('Пастернак Б.Л.', 8)]

In [59]:
%%sql

SELECT name_author,
       ROW_NUMBER() OVER(PARTITION BY name_author) AS w
FROM book JOIN author USING(author_id)

 * sqlite://
Done.

[('Булгаков М.А.', 1),
 ('Булгаков М.А.', 2),
 ('Достоевский Ф.М.', 1),
 ('Достоевский Ф.М.', 2),
 ('Достоевский Ф.М.', 3),
 ('Есенин С.А.', 1),
 ('Есенин С.А.', 2),
 ('Пастернак Б.Л.', 1)]

Для функций RANK() и DENSE_RANK() необходимо использование ORDER BY внутри OVER().

Иначе получится столбец единичек

In [68]:
%%sql

SELECT name_author,
       RANK() OVER(ORDER BY name_author ASC) AS w
FROM book JOIN author USING(author_id)

 * sqlite://
Done.

[('Булгаков М.А.', 1),
 ('Булгаков М.А.', 1),
 ('Достоевский Ф.М.', 3),
 ('Достоевский Ф.М.', 3),
 ('Достоевский Ф.М.', 3),
 ('Есенин С.А.', 6),
 ('Есенин С.А.', 6),
 ('Пастернак Б.Л.', 8)]

In [69]:
%%sql

SELECT name_author,
       DENSE_RANK() OVER(ORDER BY name_author ASC) AS w
FROM book JOIN author USING(author_id)

 * sqlite://
Done.

[('Булгаков М.А.', 1),
 ('Булгаков М.А.', 1),
 ('Достоевский Ф.М.', 2),
 ('Достоевский Ф.М.', 2),
 ('Достоевский Ф.М.', 2),
 ('Есенин С.А.', 3),
 ('Есенин С.А.', 3),
 ('Пастернак Б.Л.', 4)]

Теперь добавим немного "смысла" от употребления оконных функций и будем ранжировать строки отдельно внутри каждого жанра по имени автора

In [70]:
%%sql

SELECT name_author,
       name_genre,
       RANK() OVER(PARTITION BY genre_id ORDER BY name_author ASC) AS w
FROM genre JOIN book USING(genre_id) JOIN author USING(author_id)

 * sqlite://
Done.

[('Булгаков М.А.', 'Роман', 1),
 ('Булгаков М.А.', 'Роман', 1),
 ('Достоевский Ф.М.', 'Роман', 3),
 ('Достоевский Ф.М.', 'Роман', 3),
 ('Достоевский Ф.М.', 'Роман', 3),
 ('Есенин С.А.', 'Поэзия', 1),
 ('Есенин С.А.', 'Поэзия', 1),
 ('Пастернак Б.Л.', 'Поэзия', 3)]

In [71]:
%%sql

SELECT name_author,
       name_genre,
       DENSE_RANK() OVER(PARTITION BY genre_id ORDER BY name_author ASC) AS w
FROM genre JOIN book USING(genre_id) JOIN author USING(author_id)

 * sqlite://
Done.

[('Булгаков М.А.', 'Роман', 1),
 ('Булгаков М.А.', 'Роман', 1),
 ('Достоевский Ф.М.', 'Роман', 2),
 ('Достоевский Ф.М.', 'Роман', 2),
 ('Достоевский Ф.М.', 'Роман', 2),
 ('Есенин С.А.', 'Поэзия', 1),
 ('Есенин С.А.', 'Поэзия', 1),
 ('Пастернак Б.Л.', 'Поэзия', 2)]

In [72]:
%%sql

SELECT name_author,
       name_genre,
       ROW_NUMBER() OVER(PARTITION BY genre_id ORDER BY name_author ASC) AS w
FROM genre JOIN book USING(genre_id) JOIN author USING(author_id)

 * sqlite://
Done.

[('Булгаков М.А.', 'Роман', 1),
 ('Булгаков М.А.', 'Роман', 2),
 ('Достоевский Ф.М.', 'Роман', 3),
 ('Достоевский Ф.М.', 'Роман', 4),
 ('Достоевский Ф.М.', 'Роман', 5),
 ('Есенин С.А.', 'Поэзия', 1),
 ('Есенин С.А.', 'Поэзия', 2),
 ('Пастернак Б.Л.', 'Поэзия', 3)]

LAG() - возвращает предыдущее значение

LEAD() - возвращает следующее значение

In [76]:
%%sql

SELECT title,
       price,
       LAG(price) OVER() as prev,
       LEAD(price) OVER() as next
FROM book

 * sqlite://
Done.

[('Мастер и Маргарита', 670.99, None, 540.5),
 ('Белая гвардия ', 540.5, 670.99, 500),
 ('Идиот', 500, 540.5, 799.01),
 ('Братья Карамазовы', 799.01, 500, 500),
 ('Игрок', 500, 799.01, 650),
 ('Стихотворения и поэмы', 650, 500, 570.2),
 ('Черный человек', 570.2, 650, 518.99),
 ('Лирика', 518.99, 570.2, None)]

Решим (внезапно) такую задачу: В нашем книжном магазине появилась таблица логов о времени покупки книги (в секундах).

Определим сессию покупок как интервал времени, в течение которого разница между последовательными покупками покупателя не превышает 30 минут.

Необходимо посчитать количество сессий для каждого покупателя.

In [82]:
%%sql

DROP TABLE IF EXISTS logs;

CREATE TABLE IF NOT EXISTS logs(
    user_id STRING,
    time INTEGER
);

INSERT INTO logs(user_id, time)
VALUES ('u1', 0),
       ('u1', 20),
       ('u2', 30),
       ('u2', 40),
       ('u1', 40),
       ('u1', 60),
       ('u2', 65),
       ('u1', 80),
       ('u1', 130),
       ('u1', 150),
       ('u1', 200);

SELECT *
FROM logs;

 * sqlite://
Done.
Done.
11 rows affected.
Done.

[('u1', 0),
 ('u1', 20),
 ('u2', 30),
 ('u2', 40),
 ('u1', 40),
 ('u1', 60),
 ('u2', 65),
 ('u1', 80),
 ('u1', 130),
 ('u1', 150),
 ('u1', 200)]

In [96]:
%%sql

SELECT user_id,
       SUM(diff) + 1 AS amount_of_sessions
FROM(
    SELECT user_id,
        IIF(time - LAG(time) OVER(PARTITION BY user_id ORDER BY user_id) > 30, 1, 0) AS diff
    FROM logs
    ORDER BY user_id) as 'total'
GROUP BY user_id
ORDER BY user_id;

 * sqlite://
Done.

[('u1', 3), ('u2', 1)]